# Assignment 2 â€“ Working with Pandas

This notebook covers DataFrame creation, filtering, grouping, and basic data analysis.

In [1]:
import pandas as pd

## 1. Create DataFrame and Basic Analysis

In [2]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve'],
    'Age': [24, 27, 22, 32, 29],
    'Department': ['HR', 'Finance', 'IT', 'Marketing', 'HR'],
    'Salary': [45000, 54000, 50000, 62000, 47000]
}

df = pd.DataFrame(data)
df

      Name  Age Department  Salary
0    Alice   24         HR   45000
1      Bob   27    Finance   54000
2  Charlie   22         IT   50000
3    Diana   32  Marketing   62000
4      Eve   29         HR   47000

In [3]:
print('Summary Statistics:')
print(df[['Age', 'Salary']].describe())

avg_hr_salary = df[df['Department'] == 'HR']['Salary'].mean()
print('Average HR Salary:', avg_hr_salary)

Summary Statistics:
             Age        Salary
count   5.000000      5.000000
mean   26.800000  51600.000000
std     3.962323   6730.527468
min    22.000000  45000.000000
25%    24.000000  47000.000000
50%    27.000000  50000.000000
75%    29.000000  54000.000000
max    32.000000  62000.000000
Average HR Salary: 46000.0

## 2. Add Bonus Column

In [4]:
df['Bonus'] = df['Salary'] * 0.10
df

      Name  Age Department  Salary   Bonus
0    Alice   24         HR   45000  4500.0
1      Bob   27    Finance   54000  5400.0
2  Charlie   22         IT   50000  5000.0
3    Diana   32  Marketing   62000  6200.0
4      Eve   29         HR   47000  4700.0

## 3. Filter Employees Aged Between 25 and 30

In [5]:
filtered_df = df[(df['Age'] >= 25) & (df['Age'] <= 30)]
filtered_df

  Name  Age Department  Salary   Bonus
1  Bob   27    Finance   54000  5400.0
4  Eve   29         HR   47000  4700.0

## 4. Group by Department

In [6]:
grouped = df.groupby('Department')['Salary'].mean()
grouped

Department
Finance      54000.0
HR           46000.0
IT           50000.0
Marketing    62000.0
Name: Salary, dtype: float64

## 5. Sort by Salary and Save to CSV

In [10]:
sorted_df = df.sort_values(by='Salary')
sorted_df.to_csv('sorted_salary.csv', index=False)
sorted_df

      Name  Age Department  Salary   Bonus
0    Alice   24         HR   45000  4500.0
4      Eve   29         HR   47000  4700.0
2  Charlie   22         IT   50000  5000.0
1      Bob   27    Finance   54000  5400.0
3    Diana   32  Marketing   62000  6200.0